Map<String, String> commentError = {
  '400': '数据不合法',
  '511': '评论数据库推送失败',
  '512': '回复数据库推送失败',
  '513': '言论数据库插入失败',
  '514': '消息数据库插入失败',
};

Map<String, String> loginError = {
  '400': '数据不合法',
  '422': '账号或密码错误',
  '450': '没用手机号登陆过教务',
  '510': '教务挂了',
  '511': '用户信息数据库查询失败',
  '512': '新用户数据库插入失败',
};

Map<String, String> nickError = {
  '400': '数据不合法',
  '511': '用户不存在',
  '512': '用户信息数据库查询失败',
  '513': '昵称数据库覆写失败',
};

Map<String, String> getCatError = {
  '511': '该猫咪不存在',
  '512': '猫咪信息数据库查询失败'
};

Map<String, String> positionError = {
  '400': '数据不合法',
  '401': '用户不存在',
  '511': '用户信息数据库查询失败',
  '512': '该猫咪不存在',
  '513': '猫咪数据库查询失败',
  '514': '猫咪数据库推送失败',
};

Map<String, String> versionError = {};